[
  {
    "name": "Dana vs Donation",
    "secular_one_liner": "Donation implies transfer of money or goods, often transactional or tax-motivated.",
    "dharmic_one_liner": "Dana (दान) is virtuous giving as part of dharma and yajna, characterized by intention and purity (sattvika dana: to a worthy recipient, at the right time, without expectation).",
    "sanskrit_glossary": [
      "Dana (दान)",
      "Sattvika Dana (सात्त्विक दान)",
      "Rajasika or Tamasika Dana (राजसिक/तामसिक दान)",
      "Yajna (यज्ञ)"
    ],
    "refs": [
      "Bhagavad Gita | 17 | 20 | Sattvika dana is given at the proper time and place to a worthy person without expectation.",
      "Bhagavad Gita | 17 | 21 | Rajasika dana is given for a return.",
      "Bhagavad Gita | 17 | 22 | Tamasika dana is given at the wrong place or time to unworthy persons."
    ],
    "sadhana": [
      "Begin work with sankalpa: frame it as yajña."
    ],
    "tags": [
      "donation",
      "dharmic",
      "purity",
      "defined",
      "transaction",
      "worthiness",
      "giving",
      "payment"
    ]
  },
  {
    "name": "Loka vs World/Region",
    "secular_one_liner": "World or region in English implies a physical place or geopolitical area.",
    "dharmic_one_liner": "Loka (लोक) are experiential planes or fields of reality (gross to subtle) in which beings experience karma; includes Bhur, Bhuvar, Svar and higher lokas.",
    "sanskrit_glossary": [
      "Loka (लोक)",
      "Triloka (त्रिलोक)",
      "Devaloka (देवलोक)",
      "Naraka (नरक)"
    ],
    "refs": [
      "Bhagavad Gita | 8 | 16 | All worlds up to Brahmaloka are subject to return; attaining Me there is no rebirth.",
      "Rig Veda | 1 | References to multiple lokas and cosmic order.",
      "Puranas | Descriptions of fourteen worlds and their functions."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "world",
      "loka",
      "planes",
      "refers",
      "geography",
      "country",
      "ontological",
      "region"
    ]
  },
  {
    "name": "Jati & Varna vs Caste",
    "secular_one_liner": "Caste is a colonial term for rigid birth hierarchies.",
    "dharmic_one_liner": "Varna (वर्ण) is functional classification by guna and karma; Jati (जाति) is birth community.",
    "sanskrit_glossary": [
      "Varna (वर्ण)",
      "Jati (जाति)",
      "Guna-Karma (गुण-कर्म)",
      "Svadharma (स्वधर्म)"
    ],
    "refs": [
      "Bhagavad Gita | 4 | 13 | Fourfold order created based on guna and karma.",
      "Bhagavad Gita | 18 | 41 | Duties of varnas are described by their qualities.",
      "Mahabharata | Shanti Parva | Discussions on fluidity and ethics in social duties."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "hierarchy",
      "based",
      "history",
      "qualities",
      "jati",
      "shaped",
      "later",
      "rigid"
    ]
  },
  {
    "name": "Shakti & Kundalini vs Holy Spirit",
    "secular_one_liner": "The Holy Spirit in Christian theology is the third Person of the Trinity, a personal divine agent of grace.",
    "dharmic_one_liner": "Shakti (शक्ति) is cosmic power, the dynamic potency of the Absolute.",
    "sanskrit_glossary": [
      "Shakti (शक्ति)",
      "Kundalini (कुण्डलिनी)",
      "Shakta (शाक्त)",
      "Shiva-Shakti (शिव-शक्ति)"
    ],
    "refs": [
      "Saundarya Lahari | 1 | Shiva is unable to move without Shakti; union of consciousness and power.",
      "Yoga Kundalini Upanishad | 1 | Description of Kundalini and awakening through yoga.",
      "Bhagavad Gita | 7 | 6 | I am the source and dissolution of the entire universe."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "holy",
      "kundalini",
      "cosmic",
      "trinitarian",
      "energy",
      "theology",
      "impersonal",
      "hypostasis"
    ]
  },
  {
    "name": "Devata vs Pagan god",
    "secular_one_liner": "Pagan god implies a false deity of a pre-Christian polytheism.",
    "dharmic_one_liner": "Devata (देवता) are luminous intelligences, functional aspects of the one Reality (Ishvara), governing principles of cosmos and psyche.",
    "sanskrit_glossary": [
      "Devata (देवता)",
      "Ishvara (ईश्वर)",
      "Saguna Brahman (सगुण ब्रह्म)",
      "Upasana (उपासना)"
    ],
    "refs": [
      "Bhagavad Gita | 7 | 21 | I make the faith of each devotee steady toward that form which he worships.",
      "Bhagavad Gita | 4 | 11 | As people approach Me, so do I receive them; all paths lead to Me.",
      "Rig Veda | 1 | 46 | Truth is One; the wise speak of it in many ways."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "pagan",
      "functional",
      "deities",
      "devatas",
      "devata",
      "rival",
      "god",
      "manifestations"
    ]
  },
  {
    "name": "Yajna vs Sacrifice",
    "secular_one_liner": "In English, sacrifice suggests giving up something of value, often with associations of blood or loss.",
    "dharmic_one_liner": "Yajna (यज्ञ) is sacred offering and reciprocity that sustains cosmic order: mutual nourishment of devas, humans, and nature; includes ritual fire, mantra, and ethical service.",
    "sanskrit_glossary": [
      "Yajna (यज्ञ)",
      "Deva (देव)",
      "Ahuti (आहुति)",
      "Dana (दान)"
    ],
    "refs": [
      "Bhagavad Gita | 3 | 10 | Prajapati created beings with yajna, saying: by this shall you prosper.",
      "Bhagavad Gita | 3 | 11 | Nourish the devas by yajna and they will nourish you; mutuality.",
      "Bhagavad Gita | 4 | 24 | The whole act of offering, offerer, and fire can be seen as Brahman."
    ],
    "sadhana": [
      "Begin work with sankalpa: frame it as yajña."
    ],
    "tags": [
      "narrow",
      "yajna",
      "sacrifice",
      "sacred",
      "reciprocity",
      "violent",
      "inherently",
      "sense"
    ]
  },
  {
    "name": "Karma vs Suffering",
    "secular_one_liner": "Colloquially, karma is misused to mean bad luck or deserved suffering.",
    "dharmic_one_liner": "Karma (कर्म) means action and its causal results (karmaphala) across lives; it includes punya and papa.",
    "sanskrit_glossary": [
      "Karma (कर्म)",
      "Karma-phala (कर्मफल)",
      "Punya (पुण्य)",
      "Papa (पाप)"
    ],
    "refs": [
      "Bhagavad Gita | 4 | 17 | The subtlety of action, inaction, and wrong action.",
      "Bhagavad Gita | 3 | 9 | Acts done as sacrifice do not bind; otherwise they cause bondage.",
      "Brihadaranyaka Upanishad | 4 | 5 | As one acts, so one becomes; one goes to good by good action."
    ],
    "sadhana": [
      "Begin work with sankalpa: frame it as yajña.",
      "Practice Asaktaḥ: release attachment to outcomes."
    ],
    "tags": [
      "outcomes",
      "positive",
      "growth",
      "karma",
      "includes",
      "action",
      "punya",
      "suffering"
    ]
  },
  {
    "name": "Moksha vs Salvation",
    "secular_one_liner": "In Western usage, salvation is rescue by God after a single lifetime, often contingent on belief and grace.",
    "dharmic_one_liner": "Moksha (मोक्ष) is liberation from samsara (rebirth cycle) through realization of Atman as Brahman, ending avidya and bondage.",
    "sanskrit_glossary": [
      "Moksha (मोक्ष)",
      "Samsara (संसार)",
      "Jivanmukti (जीवन्मुक्ति)",
      "Avidya (अविद्या)"
    ],
    "refs": [
      "Bhagavad Gita | 2 | 72 | Established in Brahman, one is not deluded and attains Brahmi state; this is liberation.",
      "Mundaka Upanishad | 3 | 9 | He who knows Brahman becomes Brahman; knots of the heart are cut.",
      "Katha Upanishad | 2 | 14 | When all desires cease, the mortal becomes immortal here."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "ignorance",
      "realization",
      "decree",
      "salvation",
      "after",
      "merely",
      "rebirth",
      "death"
    ]
  },
  {
    "name": "Avatara vs Prophet",
    "secular_one_liner": "In Abrahamic usage, a prophet is a human messenger chosen by God to deliver divine commandments, warnings, or revelations.",
    "dharmic_one_liner": "An Avatara (अवतारः) is a deliberate descent of the Divine into embodied form, to restore Dharma and protect devotees.",
    "sanskrit_glossary": [
      "Avatara (अवतार)",
      "Ishvara (ईश्वर)",
      "Lila (लीला)",
      "Dharma (धर्म)",
      "Bhakta (भक्त)"
    ],
    "refs": [
      "Bhagavad Gita | 4 | 7 | Whenever Dharma declines and Adharma rises, I manifest Myself.",
      "Bhagavad Gita | 4 | 8 | To protect the righteous, destroy the wicked, and establish Dharma, I appear age after age.",
      "Bhagavata Purana | 3 | Lists the Avataras of Vishnu, describing their functions in cosmic order.",
      "Vishnu Purana | 1 | The concept of divine descents and their purposes in restoring balance."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "direct",
      "avataras",
      "prophets",
      "messenger",
      "world",
      "embody",
      "convey",
      "avatara"
    ]
  },
  {
    "name": "Yogi vs Saint",
    "secular_one_liner": "In common Western/Christian usage, a “saint” is a canonized figure, often celibate, recognized posthumously for piety, virtue, and miracles.",
    "dharmic_one_liner": "A Yogi (योगी) is one who is established in Yoga — union, discipline, and direct experience of the Self.",
    "sanskrit_glossary": [
      "Yogi (योगी)",
      "Yoga (योग)",
      "Sadhana (साधन)",
      "Samadhi (समाधि)",
      "Moksha (मोक्ष)"
    ],
    "refs": [
      "Bhagavad Gita | 6 | 46 | The Yogi is greater than the ascetic, greater than the learned, greater than the ritualist.",
      "Bhagavad Gita | 6 | 47 | Of all Yogis, the greatest is the one with Shraddha who abides in Me with devotion.",
      "Yoga Sutras | 1 | Yoga is the cessation of the fluctuations of the mind.",
      "Mahabharata, Shanti Parva | 12.289.7 | A Yogi is one who unites with the supreme through meditation and discipline."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "moral",
      "practitioners",
      "discipline",
      "canonized",
      "yogis",
      "realization",
      "person",
      "exemplars"
    ]
  },
  {
    "name": "Rishi vs Saint",
    "secular_one_liner": "In Western/Christian usage, a “saint” is a canonized holy person, usually recognized posthumously by the Church for exemplary virtue, miracles, or martyrdom.",
    "dharmic_one_liner": "A Rishi (ऋषिः) is a seer of mantra and truth — one who has “heard” (Shruti) through tapas (austerity), dhyana (meditation), and samadhi.",
    "sanskrit_glossary": [
      "Rishi (ऋषिः)",
      "Mantra-drashta (मन्त्रद्रष्टा)",
      "Shruti (श्रुति)",
      "Tapas (तपस्)",
      "Dhyana (ध्यान)",
      "Samadhi (समाधि)"
    ],
    "refs": [
      "Rig Veda | 1 | 1 | Attributed to Rishi Madhuchhandas; demonstrates Rishis as seers of mantra.",
      "Brihadaranyaka Upanishad | 2 | Rishis are those who realize Brahman through tapas and meditation.",
      "Bhagavad Gita | 10 | 6 | The great Rishis, seven before and four Manus, born of the mind of the Lord.",
      "Manusmriti | 1 | 23 | The Rishis received knowledge from Brahma and transmitted Dharma."
    ],
    "sadhana": [
      "Do daily japa or dhyāna for 10–15 minutes to steady guṇas."
    ],
    "tags": [
      "canonized",
      "through",
      "saints",
      "figure",
      "rishis",
      "recognized",
      "direct",
      "dharma"
    ]
  },
  {
    "name": "Murti vs Idol",
    "secular_one_liner": "In common Western usage, an idol is a mere statue or object mistakenly worshipped as a god, often implying superstition.",
    "dharmic_one_liner": "In Dharma, a Murti (मूर्ति) is a consecrated embodiment of the divine presence, established through Prana Pratishtha (प्राण प्रतिष्ठा) per Agama and Shilpa Shastra.",
    "sanskrit_glossary": [
      "Murti (मूर्ति)",
      "Vigraha (विग्रह)",
      "Prana Pratishtha (प्राण प्रतिष्ठा)",
      "Archavatara (अर्चावतार)",
      "Darshana (दर्शन)",
      "Shilpa Shastra (शिल्प शास्त्र)"
    ],
    "refs": [
      "Bhagavad Gita | 9 | 26 | Offerings of leaf, flower, fruit, or water made with devotion are accepted by the Lord.",
      "Bhagavata Purana | 27 | Detailed guidelines for worship, establishing the deity, and the theology of temple service.",
      "Pancharatra Agamas | General | Procedures for Prana Pratishtha, daily worship, and Murti-related rituals.",
      "Shilpa Shastra | Vishvakarma tradition | Canonical rules for proportions, materials, and iconographic correctness of sacred forms."
    ],
    "sadhana": [
      "Begin work with sankalpa: frame it as yajña."
    ],
    "tags": [
      "shilpa",
      "devotion",
      "murti",
      "idol",
      "consecrated",
      "implies",
      "statue",
      "presence"
    ]
  },
  {
    "name": "Dharma vs Religion",
    "secular_one_liner": "In Western framing, “religion” means a fixed set of beliefs, rituals, and institutionalized practices centered on worship of God, with boundaries and exclusivity (e.g., Christianity, Islam).",
    "dharmic_one_liner": "Dharma (धर्म) is not “religion” but the inherent order, law, and duty that sustains the cosmos and individual life.",
    "sanskrit_glossary": [
      "Dharma (धर्म)",
      "Sanatana Dharma (सनातन धर्म)",
      "Svadharma (स्वधर्म)",
      "Ṛta (ऋत)"
    ],
    "refs": [
      "Bhagavad Gita | 4 | 7 | Whenever there is decline of Dharma and rise of Adharma, I manifest myself.",
      "Bhagavad Gita | 3 | 35 | Better to follow one’s own dharma (svadharma) imperfectly than another’s dharma perfectly.",
      "Manusmriti | 2 | 6 | The whole of Dharma is that which is taught in the Vedas and Smriti.",
      "Mahabharata | Karna Parva | 69.58 | Dharma is subtle; it protects those who protect it."
    ],
    "sadhana": [
      "Check alignment with svadharma and adhikāra before acting."
    ],
    "tags": [
      "systems",
      "exclusivity",
      "dharma",
      "religion",
      "belief",
      "beliefs",
      "implies",
      "contextual"
    ]
  },
  {
    "name": "Brahman vs God",
    "secular_one_liner": "In common Western usage, “God” usually means a personal, creator-deity with will, emotions, commandments, and judgment (monotheistic theism).",
    "dharmic_one_liner": "In Dharma, Brahman (ब्रह्मन्) is the impersonal, infinite, attributeless Absolute (Nirguna Brahman), the ground of being and consciousness.",
    "sanskrit_glossary": [
      "Brahman (ब्रह्मन्)",
      "Nirguna Brahman (निर्गुण ब्रह्म)",
      "Saguna Brahman (सगुण ब्रह्म)",
      "Ishvara (ईश्वर)",
      "Atman (आत्मन्)"
    ],
    "refs": [
      "Bhagavad Gita | 8 | 3 | Aksharam Brahma paramam: the imperishable is the supreme Brahman.",
      "Bhagavad Gita | 14 | 27 | Krishna as the support of Brahman (brahmano hi pratishtha aham).",
      "Taittiriya Upanishad | 2.1.1 | Brahman is satyam, jnanam, anantam (truth, knowledge, infinite).",
      "Chandogya Upanishad | 6.8.7 | Tat tvam asi: the Atman (Self) is Brahman."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "dharma",
      "agent",
      "absolute",
      "theism",
      "willing",
      "distinguishes",
      "impersonal",
      "western"
    ]
  },
  {
    "name": "Secularism vs Pluralism",
    "secular_one_liner": "Secularism arose in Europe as a truce after Catholic-Protestant wars, meaning minimum tolerance by privatizing religion.",
    "dharmic_one_liner": "Pluralism in Dharma affirms many paths to the One: Ekaṁ Sat Viprā Bahudhā Vadanti (एकं सत् विप्रा बहुधा वदन्ति).",
    "sanskrit_glossary": [
      "Ekam Sat Vipra Bahudha Vadanti (एकं सत् विप्रा बहुधा वदन्ति)"
    ],
    "refs": [
      "Rig Veda | 1 | 46 | Truth is One, expressed in many ways.",
      "Bhagavad Gita | 4 | 11 | As people approach Me, I receive them; all paths lead to Me."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "pluralism",
      "secularism"
    ]
  },
  {
    "name": "YOLO vs Gift of Life",
    "secular_one_liner": "YOLO (You Only Live Once) fuels urgency, maximization, indulgence, and fear of missing out.",
    "dharmic_one_liner": "Dharma: human life is Durlabha Jivanam (दुर्लभ जीवनम्), a rare gift, not for indulgence but for svadharma and moksha.",
    "sanskrit_glossary": [
      "Durlabha Jivanam (दुर्लभ जीवनम्)"
    ],
    "refs": [
      "Bhagavata Purana | 9 | 29 | Human life is rare, fleeting, yet can grant liberation."
    ],
    "sadhana": [
      "Check alignment with svadharma and adhikāra before acting."
    ],
    "tags": [
      "life",
      "yolo",
      "gift",
      "of"
    ]
  },
  {
    "name": "Equality vs Adhikara-bheda",
    "secular_one_liner": "Modern equality is grounded in the idea that 'all men are created equal in the eyes of God,' leading to sameness in roles, rights, and entitlements.",
    "dharmic_one_liner": "The dharmic view distinguishes between the ontological oneness of ātman and the diverse evolution of its expression through guṇa–karma. True samatva (equanimity) lies in seeing all ātman as equal in essence, while adhikāra-bheda (functional differentiation) honors the unique svadharma each being carries as a divine gift.",
    "sanskrit_glossary": [
      "Ātman (आत्मन्) – the Self, equal in essence across all beings",
      "Samatva (समत्व) – equanimity of vision, seeing ātman equally",
      "Adhikāra-bheda (अधिकारभेद) – differentiation of roles, duties, and eligibility",
      "Svadharma (स्वधर्म) – one’s own dharma arising from guṇa–karma",
      "Guṇa (गुण) – qualities of nature: sattva, rajas, tamas",
      "Svabhāva (स्वभाव) – innate nature, expression of one’s being"
    ],
    "refs": [
      "Bhagavad Gita | 5 | 18 | The wise see equally a learned brāhmaṇa, a cow, an elephant, a dog, and an outcaste.",
      "Bhagavad Gita | 3 | 35 | Better is one’s own dharma, though imperfect, than another’s dharma well performed.",
      "Bhagavad Gita | 18 | 41–44 | Varṇas distinguished by guṇa and karma, not by birth alone."
    ],
    "sadhana": [
      "Contemplate ātman: meditate daily on the equal essence of all beings.",
      "Discern svabhāva: reflect on your guṇa tendencies and svadharma to align action with role.",
      "Respect diversity: honor the unique functions others embody instead of demanding sameness.",
      "Practice samatva: maintain equanimity toward all beings, while supporting adhikāra-based distinctions."
    ],
    "tags": [
      "equality",
      "adhikara",
      "samatva",
      "svadharma",
      "diversity",
      "roles",
      "justice"
    ]
  },
  {
    "name": "Faith vs Shraddha",
    "secular_one_liner": "Faith (fides) = trust or belief, often external and propositional.",
    "dharmic_one_liner": "Shraddha (श्रद्धा) = placing the heart in truth.",
    "sanskrit_glossary": [
      "Shraddha (श्रद्धा)"
    ],
    "refs": [
      "Bhagavad Gita | 17 | 3 | A person is made of their Shraddha; as their Shraddha, so they are.",
      "Yoga Sutras | Shraddha is the first support for samadhi."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "faith",
      "shraddha"
    ]
  },
  {
    "name": "Validation Principle",
    "secular_one_liner": "Modern validation means telling someone “your feelings are valid” to build trust and safety.",
    "dharmic_one_liner": "In Dharma, feelings are acknowledged but tested against Svadharma (स्वधर्म) vs Sva-iccha (स्वेच्छा).",
    "sanskrit_glossary": [
      "Svadharma (स्वधर्म)",
      "Sva-iccha (स्वेच्छा)"
    ],
    "refs": [
      "Bhagavad Gita | 3 | 35 | Better to follow one’s own duty imperfectly than another’s duty perfectly."
    ],
    "sadhana": [
      "Check alignment with svadharma and adhikāra before acting."
    ],
    "tags": [
      "validation",
      "principle"
    ]
  },
  {
    "name": "Judgment & Adhikara",
    "secular_one_liner": "Popular culture says “don’t judge” to avoid harshness.",
    "dharmic_one_liner": "Dharma recognizes judgment (Viveka विवेक) as natural, but only with Adhikara (अधिकार) — eligibility, qualification, maturity to discern.",
    "sanskrit_glossary": [
      "Viveka (विवेक)",
      "Adhikara (अधिकार)"
    ],
    "refs": [
      "Bhagavad Gita | 18 | 63 | Deliberate fully with your understanding, then act as you choose."
    ],
    "sadhana": [
      "Check alignment with svadharma and adhikāra before acting."
    ],
    "tags": [
      "judgment",
      "adhikara"
    ]
  },
  {
    "name": "Soul vs Atman",
    "secular_one_liner": "Soul (from Latin anima) in Abrahamic context = unique personal essence, created, one lifetime, judged for salvation.",
    "dharmic_one_liner": "Atman (आत्मन्) = eternal, unborn, uncreated pure consciousness; identical with Brahman; jiva (जीव) is embodied self that transmigrates.",
    "sanskrit_glossary": [
      "Atman (आत्मन्)",
      "Jiva (जीव)",
      "Paramatman (परमात्मन्)"
    ],
    "refs": [
      "Bhagavad Gita | 2 | 20 | The Atman is never born nor does it die.",
      "Chandogya Upanishad | 6 | 7 | Tat Tvam Asi: You are That."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "atman",
      "soul"
    ]
  },
  {
    "name": "Pravritti vs Nivritti",
    "secular_one_liner": "Secular frameworks conflate worldly engagement and renunciation, often valuing only productivity or only withdrawal.",
    "dharmic_one_liner": "Dharma distinguishes: Pravritti (प्रवृत्ति) = engagement in duties with equanimity (sthita-prajna), Nivritti (निवृत्ति) = withdrawal for moksha (jivanmukti).",
    "sanskrit_glossary": [
      "Pravritti (प्रवृत्ति)",
      "Nivritti (निवृत्ति)",
      "Sthita-prajna (स्थितप्रज्ञ)",
      "Jivanmukta (जीवन्मुक्त)"
    ],
    "refs": [
      "Bhagavad Gita | 3 | 19 | Perform your duty without attachment; by doing so, one attains the Supreme.",
      "Bhagavad Gita | 6 | 1 | True renunciation is not abandoning duty, but acting without attachment."
    ],
    "sadhana": [
      "Apply karma-yoga posture; take one small daily practice; conduct a weekly reflection."
    ],
    "tags": [
      "pravritti",
      "nivritti"
    ]
  },
  {
  "name": "Evidence vs Pramāṇa",
  "secular_one_liner": "Western framework opposes rationality (empirical proof) to faith (blind belief), leaving no integrated spectrum.",
  "dharmic_one_liner": "Dharmic epistemology offers multiple pramāṇas: pratyakṣa (perception), anumāna (inference), upamāna (analogy), and śabda (authoritative testimony). Śabda is valid only when spoken by an āpta — a practitioner or realized guide — with its own standards, not blind faith.",
  "sanskrit_glossary": [
    "Pramāṇa (प्रमाण) – means of valid knowledge",
    "Pratyakṣa (प्रत्यक्ष) – direct perception",
    "Anumāna (अनुमान) – inference",
    "Upamāna (उपमान) – analogy",
    "Śabda (शब्द) – reliable testimony from an āpta",
    "Āpta (आप्त) – trustworthy practitioner or realized being"
  ],
  "refs": [
    "Nyāya Sūtra | 1 | 1 | Lists pramāṇas as sources of valid knowledge.",
    "Bhagavad Gita | 4 | 34 | Approach a realized guru, inquire with humility, and learn from their example.",
    "Yoga Sūtra | 1 | 7 | Pratyakṣa, anumāna, and āgama (śabda) are valid pramāṇas."
  ],
  "sadhana": [
    "Observe reality directly through pratyakṣa: train mindful perception.",
    "Apply anumāna: reason carefully from observed cause-effect.",
    "Use upamāna: strengthen learning through analogy and metaphor.",
    "Seek śabda only from āpta sources: engage with realized teachers, not mere theorists."
  ],
  "tags": ["evidence", "rationality", "faith", "pramāṇa", "śabda", "guru", "epistemology"]
},
{
  "name": "Mind vs Intellect vs Ego",
  "secular_one_liner": "Western thought often lumps thoughts, emotions, and decisions into 'the mind,' with ego seen mainly as pride or self-image.",
  "dharmic_one_liner": "Dharmic psychology separates the inner instrument (antaḥkaraṇa) into manas (mind, doubting and emotive), buddhi (intellect, discriminating and deciding), ahaṅkāra (ego, the 'I'-maker), and citta (memory, storehouse of impressions). Ego is not mere pride but the principle of identity itself.",
  "sanskrit_glossary": [
    "Antaḥkaraṇa (अन्तःकरण) – inner instrument of mind",
    "Manas (मनस्) – sensory mind, doubting, emotive",
    "Buddhi (बुद्धि) – intellect, discrimination, decision",
    "Ahaṅkāra (अहंकार) – ego, 'I'-maker, sense of identity",
    "Citta (चित्त) – memory, storehouse of saṃskāras"
  ],
  "refs": [
    "Bhagavad Gita | 3 | 42 | Indriyāṇi parāṇy āhur manasas tu parā manaḥ, buddhir yasya parā buddhiḥ – Senses are higher than body, mind higher than senses, intellect higher than mind.",
    "Yoga Sūtra | 1 | 2 | Yoga is citta-vṛtti-nirodhaḥ – stilling the fluctuations of citta.",
    "Sāṅkhya Kārikā | 23 | Enumerates buddhi, ahaṅkāra, manas as distinct tattvas."
  ],
  "sadhana": [
    "Train manas through pratyāhāra: withdraw senses and observe thoughts.",
    "Strengthen buddhi with viveka: daily reflection on what is eternal vs transient.",
    "Purify ahaṅkāra: affirm 'I am servant of dharma,' not just body or role.",
    "Cleanse citta: replace old saṃskāras with sattvic impressions via japa, svādhyāya."
  ],
  "tags": ["mind", "intellect", "ego", "manas", "buddhi", "ahaṅkāra", "citta", "antaḥkaraṇa"]
},
{
  "name": "System 1/2 vs Gita’s Manas–Buddhi Protocol",
  "secular_one_liner": "System 1 is fast and automatic; System 2 is slow and deliberate—but the book often stops at awareness without a concrete interception routine.",
  "dharmic_one_liner": "Gītā operationalizes a loop: moderate senses (2.58), detect the drift chain (2.62–2.63), restore buddhi (viveka), and act yoga-sthaḥ (established in yoga) and asaktaḥ (unattached). This is a more actionable System 1→2 handoff.",
  "sanskrit_glossary": [
    "Manas (मनस्) – sensory mind, quick impressions",
    "Buddhi (बुद्धि) – discriminating intellect",
    "Indriya (इन्द्रिय) – senses",
    "Pratyāhāra (प्रत्याहार) – withdrawing/quieting senses",
    "Viveka (विवेक) – discrimination",
    "Yoga-sthaḥ (योगस्थः) – established in yoga while acting",
    "Asaktaḥ (असक्तः) – unattached",
    "Saṃskāra (संस्कार) – latent impression"
  ],
  "refs": [
    "Bhagavad Gita | 2 | 58 | Like the tortoise withdrawing limbs—mastery over senses.",
    "Bhagavad Gita | 2 | 62 | Dwelling on objects breeds attachment; from attachment arises desire.",
    "Bhagavad Gita | 2 | 63 | From desire comes anger… delusion… loss of buddhi… ruin of discernment."
  ],
  "sadhana": [
    "Name the trigger: when a cue hits (System 1), label it—‘sparśa noted’.",
    "Withdraw and breathe: practice pratyāhāra for 3 breaths to cool the indriyas.",
    "Run the drift check: ask ‘Am I sliding from dwelling → attachment → craving?’",
    "Restore viveka: recall one guiding verse (e.g., BG 2.58/2.63) and your core value.",
    "Set posture: affirm ‘yoga-sthaḥ, asaktaḥ’; choose the smallest right action.",
    "Close the loop: review outcome with prāsāda-buddhi; update a concise learning note (saṃskāra hygiene)."
  ],
  "tags": [
    "system1",
    "system2",
    "manas",
    "buddhi",
    "pratyahara",
    "viveka",
    "self-regulation",
    "gita-2.58",
    "gita-2.62",
    "gita-2.63"
  ]
},
{
  "name": "Root Causes vs Vāsanā Transformation",
  "secular_one_liner": "Western therapy often digs into childhood memories to locate root causes of psychological issues.",
  "dharmic_one_liner": "Dharmic psychology acknowledges vāsanā-s (latent tendencies) but shifts focus from excavating their origin to cultivating new sattvic vāsanā-s through sādhana, gradually overriding the old.",
  "sanskrit_glossary": [
    "Vāsanā (वासना) – latent tendency, inclination",
    "Saṃskāra (संस्कार) – mental impression shaping behavior",
    "Śuddhi (शुद्धि) – purification",
    "Japa (जप) – repetition of mantra",
    "Svādhyāya (स्वाध्याय) – self-study, scriptural recitation",
    "Sevā (सेवा) – selfless service"
  ],
  "refs": [
    "Bhagavad Gita | 6 | 5 | Let a man lift himself by himself; do not degrade yourself, the self is friend and enemy.",
    "Yoga Sūtra | 1 | 18 | Impressions (saṃskāras) of past can be neutralized by cultivating new patterns of restraint.",
    "Bhagavad Gita | 12 | 12 | Better than meditation is renunciation of fruit of action, for peace immediately follows."
  ],
  "sadhana": [
    "Identify recurring vāsanā: note the pull of old habit or reaction.",
    "Plant new impression: practice japa or svādhyāya daily to seed sattvic tendencies.",
    "Redirect energy: replace indulgent activity with sevā or constructive duty.",
    "Reinforce daily: review how new vāsanā-s are strengthening, without digging into old memories."
  ],
  "tags": [
    "root cause",
    "childhood",
    "therapy",
    "vasana",
    "samskara",
    "habit change",
    "purification",
    "forward-looking"
  ]
},
{
  "name": "Targeted Elimination vs Ambience Cultivation",
  "secular_one_liner": "Western methods often aim to eliminate a specific problem directly, such as using one drug to kill one bacterium.",
  "dharmic_one_liner": "Dharmic philosophy emphasizes shaping the ambience (āhāra, vihāra, ācāra, saṅga) so that unhealthy forces—whether bacteria, vāsanā, or adharma—cannot flourish, and sattvic patterns thrive naturally.",
  "sanskrit_glossary": [
    "Āhāra (आहार) – food intake",
    "Vihāra (विहार) – recreation, lifestyle",
    "Ācāra (आचार) – conduct, daily practice",
    "Saṅga (सङ्ग) – association, company",
    "Guṇa (गुण) – qualities of nature (sattva, rajas, tamas)",
    "Kṣetra (क्षेत्र) – the field, environment or body-mind field"
  ],
  "refs": [
    "Bhagavad Gita | 17 | 8–10 | Foods that increase sattva vs foods that increase rajas and tamas.",
    "Bhagavad Gita | 6 | 17 | Yoga succeeds for one who is moderate in eating, recreation, work, and sleep.",
    "Yoga Sūtra | 2 | 11 | By meditation on opposites (pratipakṣa-bhāvanam), negative tendencies are weakened."
  ],
  "sadhana": [
    "Adjust āhāra: choose foods that support sattva, reduce tamas.",
    "Shape saṅga: spend time with those who uplift and embody dharma.",
    "Design ambience: arrange your environment to minimize triggers of old habits.",
    "Sustain sattvic cycles: set rhythms of sleep, work, and recreation to weaken unhealthy forces naturally."
  ],
  "tags": [
    "ambience",
    "ecosystem",
    "environment",
    "guna",
    "ahāra",
    "vihāra",
    "ācāra",
    "saṅga",
    "preventive"
  ]
},
{
  "name": "Fasting as Training in Indriya Withdrawal",
  "secular_one_liner": "Fasting is often seen as a dietary intervention for detox or health benefits.",
  "dharmic_one_liner": "In Dharmic practice, fasting (upavāsa/vrata) is a laboratory for indriya-nigraha: by restraining one sense (taste), the practitioner strengthens viveka, titikṣā, and the ability to withdraw all indriyas from their objects (pratyāhāra).",
  "sanskrit_glossary": [
    "Upavāsa (उपवास) – fasting, literally 'dwelling near the Self'",
    "Vrata (व्रत) – disciplined vow",
    "Indriya (इन्द्रिय) – sense organ",
    "Indriya-nigraha (इन्द्रियनिग्रह) – control of senses",
    "Pratyāhāra (प्रत्याहार) – withdrawal of senses",
    "Titikṣā (तितिक्षा) – forbearance, endurance"
  ],
  "refs": [
    "Bhagavad Gita | 2 | 58 | Like a tortoise withdrawing its limbs, one restrains the senses.",
    "Yoga Sūtra | 2 | 54–55 | Pratyāhāra is withdrawal of senses; mastery leads to supreme control.",
    "Bhagavad Gita | 6 | 17 | Yoga is not for one who eats too much or too little, but for one moderate in habits."
  ],
  "sadhana": [
    "Undertake upavāsa: observe hunger as a trigger and train restraint without suppression.",
    "Practice mindful eating: when breaking fast, eat slowly with awareness as consecrated act.",
    "Expand fasting: include mauna (speech-restraint) or screen-fasting to broaden pratyāhāra.",
    "Anchor buddhi: use verses (BG 2.58, YS 2.54) to remind why restraint is strengthening."
  ],
  "tags": [
    "fasting",
    "upavasa",
    "vrata",
    "indriya",
    "pratyahara",
    "discipline",
    "training",
    "titiksha"
  ]
},
{
  "name": "Willpower vs Tapas",
  "secular_one_liner": "Western psychology views willpower as a finite resource that depletes with use, requiring rest and replenishment.",
  "dharmic_one_liner": "Dharmic philosophy reframes discipline as tapas (तपस्): the heat of austerity and self-mastery. Tapas is not a draining resource but a transformative energy that strengthens with practice, aligning the practitioner with sattva and dharma.",
  "sanskrit_glossary": [
    "Tapas (तपस्) – heat, austerity, disciplined effort",
    "Sādhana (साधन) – spiritual practice or discipline",
    "Titikṣā (तितिक्षा) – forbearance, endurance",
    "Śuddhi (शुद्धि) – purification",
    "Sattva (सत्त्व) – clarity, balance, harmony"
  ],
  "refs": [
    "Bhagavad Gita | 17 | 14–16 | Describes bodily, verbal, and mental tapas.",
    "Bhagavad Gita | 4 | 27–28 | Sacrifices performed as tapas purify the practitioner.",
    "Manu Smṛti | 6 | 92 | Tapas is the highest purifier."
  ],
  "sadhana": [
    "Begin with a small vrata: commit to one daily discipline as tapas.",
    "Observe discomfort: when resistance arises, practice titikṣā instead of yielding.",
    "Channel tapas: use disciplined effort to burn away tamas and rajas.",
    "Expand gradually: let tapas flow into speech, thought, and action for holistic purification."
  ],
  "tags": [
    "willpower",
    "discipline",
    "tapas",
    "austerity",
    "titiksha",
    "purification",
    "sattva"
  ]
},
{
  "name": "Self-Esteem vs Ātma-bodha",
  "secular_one_liner": "Western psychology emphasizes self-esteem and self-image, often built on external validation, achievements, and social comparison.",
  "dharmic_one_liner": "Dharmic philosophy redirects the search for self-worth to ātmabodha (आत्मबोध) — knowledge of the Self. True value is intrinsic, arising from realizing the ātman as pure, eternal, and untouched by success or failure, beyond ego and roles.",
  "sanskrit_glossary": [
    "Ātma-bodha (आत्मबोध) – knowledge of the Self",
    "Ātman (आत्मन्) – the true Self, eternal witness",
    "Ahaṅkāra (अहंकार) – ego, sense of 'I'-maker",
    "Mithyā (मिथ्या) – false or illusory identification",
    "Svabhāva (स्वभाव) – true nature"
  ],
  "refs": [
    "Bhagavad Gita | 2 | 20 | The Self is unborn, eternal, never slain when the body is slain.",
    "Bhagavad Gita | 6 | 5 | Elevate yourself by your own Self, not degrade yourself; the Self is both friend and enemy.",
    "Ātma-bodha Śloka | 2 | Declares knowledge of the Self as the direct means to liberation."
  ],
  "sadhana": [
    "Observe the play of ego: notice when self-esteem rises or falls with praise or blame.",
    "Contemplate ātmabodha verses daily: reflect on the ātman as eternal and untouched.",
    "Shift identification: remind yourself 'I am not roles or achievements, I am the witness.'",
    "Anchor worth in svabhāva: practice meditation or japa affirming inner wholeness."
  ],
  "tags": [
    "self-esteem",
    "atman",
    "atma-bodha",
    "ego",
    "self-knowledge",
    "true value",
    "witness"
  ]
},
{
  "name": "Happiness vs Ānanda",
  "secular_one_liner": "In common usage, happiness is linked to material well-being, pleasure, or life satisfaction, and can rise or fall with changing circumstances.",
  "dharmic_one_liner": "Dharmic philosophy distinguishes sukha (pleasure/happiness) from ānanda (आनन्द): sukha depends on conditions, while ānanda is the intrinsic bliss of the ātman, unconditioned and ever-present. Ānanda is transcends 'true happiness' as, a transcendent state beyond sukha–duḥkha duality.",
  "sanskrit_glossary": [
    "Ānanda (आनन्द) – bliss of the Self, unconditioned joy",
    "Sukha (सुख) – conditional happiness, pleasure",
    "Duḥkha (दुःख) – pain, suffering",
    "Sat–Cit–Ānanda (सच्चिदानन्द) – existence, consciousness, bliss",
    "Ātman (आत्मन्) – the Self, eternal witness"
  ],
  "refs": [
    "Taittirīya Upaniṣad | Ānanda-valli | Describes ānanda as the essence of Brahman.",
    "Bhagavad Gita | 5 | 21 | One whose happiness is within, whose delight is within, whose light is within, is a yogi and attains Brahman.",
    "Bhagavad Gita | 6 | 28 | The yogi, freed from impurities, easily attains boundless happiness (sukham ātyantikaṃ)."
  ],
  "sadhana": [
    "Differentiate sukha and ānanda: journal when joy arises from external vs internal sources.",
    "Practice meditation: rest awareness in the Self, touching ānanda beneath transient emotions.",
    "Recite ānanda-valli verses: contemplate bliss as the nature of Brahman.",
    "Cultivate sattva through āhāra, vihāra, and svādhyāya to stabilize access to ānanda."
  ],
  "tags": [
    "happiness",
    "sukha",
    "ananda",
    "bliss",
    "self",
    "sat-cit-ananda",
    "joy"
  ]
},
{
  "name": "Mindfulness vs Sākṣī-bhāva",
  "secular_one_liner": "Mindfulness is presented as non-judgmental present-moment awareness, helpful for reducing stress and increasing focus.",
  "dharmic_one_liner": "Dharmic practice points to sākṣī-bhāva (साक्षीभाव) — abiding as the witness-consciousness. Beyond attending to thoughts, it is dis-identification from them, remembering (smṛti) the Self and reinforcing it through svādhyāya.",
  "sanskrit_glossary": [
    "Sākṣī-bhāva (साक्षीभाव) – the witness attitude",
    "Smṛti (स्मृति) – remembrance of truth",
    "Svādhyāya (स्वाध्याय) – self-study, recitation of śāstra",
    "Ātma-bodha (आत्मबोध) – knowledge of the Self",
    "Vairāgya (वैराग्य) – dispassion, detachment"
  ],
  "refs": [
    "Bhagavad Gita | 13 | 22 | The Self is the witness, permitter, sustainer, experiencer, and Lord.",
    "Bhagavad Gita | 6 | 5 | Let one lift oneself by the Self; the Self is friend and enemy.",
    "Yoga Sūtra | 1 | 3 | Then the seer abides in its true nature."
  ],
  "sadhana": [
    "Begin observation: sit in silence and label thoughts as 'seen' without chasing them.",
    "Adopt witness mantra: silently affirm 'I am sākṣī' when emotions surge.",
    "Practice smṛti: recall verses reminding the Self as beyond mind and body.",
    "Do svādhyāya: recite śāstric passages daily to reinforce the witness posture."
  ],
  "tags": [
    "mindfulness",
    "sakshi",
    "witness",
    "smriti",
    "svadhyaya",
    "atma-bodha",
    "self-awareness"
  ]
},
{
  "name": "Resilience vs Titikṣā",
  "secular_one_liner": "Resilience is the ability to bounce back from stress or adversity, restoring one’s previous state of functioning.",
  "dharmic_one_liner": "Dharmic philosophy teaches titikṣā (तितिक्षा) — forbearance with equanimity. Instead of merely recovering, one transforms by enduring heat and cold, pleasure and pain, without agitation, evolving toward the sthita-prajña (स्थितप्रज्ञ) state of steady wisdom.",
  "sanskrit_glossary": [
    "Titikṣā (तितिक्षा) – forbearance, equanimity under dualities",
    "Sthita-prajña (स्थितप्रज्ञ) – one of steady wisdom",
    "Samatva (समत्व) – evenness of mind",
    "Dvandva (द्वन्द्व) – dualities (pleasure/pain, heat/cold)",
    "Ātma-sthiti (आत्मस्थिति) – abiding in the Self"
  ],
  "refs": [
    "Bhagavad Gita | 2 | 14 | Endure cold and heat, pleasure and pain; they come and go.",
    "Bhagavad Gita | 2 | 55–57 | Marks of the sthita-prajña: free of craving and aversion, unmoved by dualities.",
    "Vivekachūḍāmaṇi | 25 | Titikṣā is the bearing of all afflictions without anxiety or lament."
  ],
  "sadhana": [
    "Notice dualities: when discomfort arises, label it as dvandva, not as threat.",
    "Practice titikṣā: endure small discomforts (heat, hunger, delay) without agitation.",
    "Anchor samatva: recall Gita 2.14, reflect that dualities are transient.",
    "Cultivate sthita-prajña ideal: daily contemplation of equanimity verses (BG 2.55–2.57)."
  ],
  "tags": [
    "resilience",
    "titiksha",
    "sthita-prajna",
    "equanimity",
    "forbearance",
    "dualities",
    "samatva"
  ]
},
{
  "name": "Sub-conscious vs Saṃskāra–Vāsanā Complex",
  "secular_one_liner": "In Western psychology, the sub-conscious is a storehouse of repressed desires and forgotten memories, often explored through therapy to uncover hidden causes.",
  "dharmic_one_liner": "Dharmic philosophy sees the saṃskāra–vāsanā complex as subtle impressions carried across many births. These cannot be erased by 'forgetting,' but can be replaced by planting new sattvic saṃskāras through abhyāsa (practice) and vairāgya (detachment), causing old ones to fade.",
  "sanskrit_glossary": [
    "Saṃskāra (संस्कार) – subtle mental impression",
    "Vāsanā (वासना) – latent tendency arising from saṃskāras",
    "Abhyāsa (अभ्यास) – steady practice",
    "Vairāgya (वैराग्य) – detachment, dispassion",
    "Citta (चित्त) – mind-stuff, seat of impressions"
  ],
  "refs": [
    "Yoga Sūtra | 1 | 12 | Abhyāsa and vairāgya are the means to still the mind.",
    "Yoga Sūtra | 2 | 10–11 | Subtle saṃskāras are destroyed by meditation; active kleśas are overcome by cultivation of opposites.",
    "Bhagavad Gita | 6 | 45 | Through many births of practice, the yogin attains perfection."
  ],
  "sadhana": [
    "Identify recurring vāsanā: observe repeated patterns in thought and action.",
    "Plant new saṃskāras: engage daily in japa, svādhyāya, or seva to lay sattvic grooves.",
    "Practice pratipakṣa-bhāvanam: consciously replace negative thought with its positive opposite.",
    "Persevere across time: remember transformation is cumulative, spanning lifetimes."
  ],
  "tags": [
    "sub-conscious",
    "samskara",
    "vasana",
    "practice",
    "abhyasa",
    "vairagya",
    "replacement",
    "karma"
  ]
},
{
  "name": "Love of God vs Bhakti",
  "secular_one_liner": "Western 'love of God' is often seen as an emotional attachment, modeled on human relationships, or as reverence and obedience to a higher being.",
  "dharmic_one_liner": "Bhakti (भक्ति) transcends mere emotion. Defined in the Narada Bhakti Sūtras as parama-prema (supreme love) and amṛta-svarūpa (immortal essence), bhakti is a total orientation of being toward the Divine, expressed through devotion, surrender, and transformative practices like śravaṇa, kīrtana, and smaraṇa.",
  "sanskrit_glossary": [
    "Bhakti (भक्ति) – devotion, participation, total orientation to the Divine",
    "Parama-prema (परमप्रेम) – supreme love (NBS 2)",
    "Amṛta-svarūpā (अमृतस्वरूपा) – essence of immortality (NBS 4)",
    "Navadhā-bhakti (नवधा-भक्ति) – ninefold modes of devotion",
    "Ātma-nivedana (आत्मनिवेदन) – self-surrender"
  ],
  "refs": [
    "Narada Bhakti Sūtra | 2 | Bhakti is of the nature of supreme love for Him.",
    "Narada Bhakti Sūtra | 4 | Bhakti is of the nature of immortality.",
    "Bhakti Rasāyana | Describes navadhā-bhakti (śravaṇa, kīrtana, smaraṇa, etc.).",
    "Bhagavad Gita | 9 | 22 | To those devoted with bhakti, I carry what they lack and preserve what they have."
  ],
  "sadhana": [
    "Practice śravaṇa: listen daily to recitations or kīrtana of divine names.",
    "Engage in smaraṇa: remember the Divine in daily acts, anchoring bhakti beyond ritual.",
    "Cultivate dāsya or sakhya: orient ego into servant-hood or friendship with the Divine.",
    "Offer ātma-nivedana: consciously surrender outcomes and identity into divine will."
  ],
  "tags": [
    "love of god",
    "bhakti",
    "narada-bhakti-sutra",
    "devotion",
    "supreme love",
    "navadha-bhakti",
    "surrender"
  ]
},
{
  "name": "Life obligations and the Six Ṛṇas",
  "secular_one_liner": "Life in the modern view is often seen as an individual pursuit of freedom, wealth, and self-expression, with obligations minimized to contracts and family ties.",
  "dharmic_one_liner": "Dharmic philosophy frames life as carrying six ṛṇas (debts): to Devas, Ṛṣis, Pitṛs, fellow humans, all beings, and the Self. Fulfillment of these is not guilt-driven but participation in the cosmic order, making life sacred duty rather than mere personal project.",
  "sanskrit_glossary": [
    "Ṛṇa (ऋण) – sacred debt or obligation",
    "Deva-ṛṇa (देवऋण) – debt to the Devas",
    "Ṛṣi-ṛṇa (ऋषिऋण) – debt to the Seers",
    "Pitṛ-ṛṇa (पितृऋण) – debt to the Ancestors",
    "Manuṣya-ṛṇa (मनुष्यऋण) – debt to Humanity",
    "Bhūta-ṛṇa (भूतऋण) – debt to Beings/Nature",
    "Ātma-ṛṇa (आत्मऋण) – debt to the Self"
  ],
  "refs": [
    "Taittirīya Saṃhitā | 6 | 3 | Describes the obligations toward Devas, Ṛṣis, and Pitṛs.",
    "Manu Smṛti | 6 | 35 | A person is born with debts to Devas, Ṛṣis, and Pitṛs; by yajña, svādhyāya, and progeny these are discharged.",
    "Bhagavad Gita | 3 | 9 | All action should be performed as yajña; otherwise it binds."
  ],
  "sadhana": [
    "Offer gratitude daily: simple prayer or mantra to acknowledge Deva-ṛṇa.",
    "Do svādhyāya: study scripture or wisdom texts to honor Ṛṣi-ṛṇa.",
    "Remember ancestors: perform rituals or simply live by values to honor Pitṛ-ṛṇa.",
    "Serve society: practice seva and generosity to honor Manuṣya-ṛṇa.",
    "Care for ecology: protect animals, trees, and resources to honor Bhūta-ṛṇa.",
    "Dedicate practice: meditation, japa, and self-inquiry to honor Ātma-ṛṇa."
  ],
  "tags": [
    "life",
    "six rnas",
    "obligation",
    "dharma",
    "debt",
    "cosmos",
    "duty"
  ]
},
{
  "name": "Pañca-kośa – The Five Sheaths",
  "secular_one_liner": "Western views of the person focus mainly on body and mind, with 'soul' as an optional belief, missing subtle and causal layers.",
  "dharmic_one_liner": "Dharmic philosophy describes five sheaths (pañca-kośa): Annamaya (physical), Prāṇamaya (vital energy), Manomaya (mental), Vijñānamaya (intellect), and Ānandamaya (bliss). These layers veil the Ātman, which shines beyond them.",
  "sanskrit_glossary": [
    "Kośa (कोश) – sheath or covering",
    "Annamaya-kośa (अन्नमयकोश) – food sheath, physical body",
    "Prāṇamaya-kośa (प्राणमयकोश) – vital-energy sheath",
    "Manomaya-kośa (मनोमयकोश) – mental sheath",
    "Vijñānamaya-kośa (विज्ञानमयकोश) – intellect/discrimination sheath",
    "Ānandamaya-kośa (आनन्दमयकोश) – bliss sheath, causal body"
  ],
  "refs": [
    "Taittirīya Upaniṣad | 2.1–2.5 | Stepwise teaching of the five kośas in the Ānanda-vallī.",
    "Bhagavad Gita | 3 | 42 | Senses > mind > intellect > Self — hints at kosha hierarchy.",
    "Yoga Vāsiṣṭha | Discusses how bliss arises when the kośas are transcended."
  ],
  "sadhana": [
    "Purify Annamaya-kośa: eat sattvic food, practice āsana.",
    "Balance Prāṇamaya-kośa: regulate breath with prāṇāyāma.",
    "Steady Manomaya-kośa: practice meditation to calm thoughts.",
    "Sharpen Vijñānamaya-kośa: cultivate viveka (discrimination) through svādhyāya.",
    "Transcend Ānandamaya-kośa: go beyond bliss to abide as the witness, the Ātman."
  ],
  "tags": [
    "kosha",
    "five sheaths",
    "annamaya",
    "pranamaya",
    "manomaya",
    "vijnanamaya",
    "anandamaya",
    "taittiriya-upanishad"
  ]
},
{
  "name": "Caste vs Varṇa–Āśrama–Jāti",
  "secular_one_liner": "The Western term 'caste,' from Portuguese and Spanish usage, fossilized Indian society into a rigid, birth-based hierarchy.",
  "dharmic_one_liner": "Dharmic categories distinguish varṇa (functional type by guṇa–karma), āśrama (life stage duties), and jāti (birth/community). These were originally fluid, contextual, and overlapping, unlike the rigid colonial construct of caste. Archival evidence collected by Dharampal shows that in early British surveys, indigenous education and village life included wide participation across jātis, revealing a more dynamic and inclusive social fabric than the colonial 'caste' lens suggests.",
  "sanskrit_glossary": [
    "Varṇa (वर्ण) – functional type, based on guṇa and karma",
    "Āśrama (आश्रम) – stage of life with its duties",
    "Jāti (जाति) – community or birth-group",
    "Guṇa (गुण) – qualities of nature: sattva, rajas, tamas",
    "Karma (कर्म) – action, conduct",
    "Svadharma (स्वधर्म) – one’s own duty",
    "Adhikāra (अधिकार) – eligibility, competence"
  ],
  "refs": [
    "Bhagavad Gita | 4 | 13 | Varṇas created according to guṇa and karma, not mere birth.",
    "Manu Smṛti | 6 | 87–90 | Describes āśrama dharmas across life stages.",
    "Mahābhārata | Anuśāsana Parva | Stories of varṇa mobility by merit and action.",
    "Dharampal | The Beautiful Tree | Early 19th-century surveys show wide access to indigenous education across communities."
  ],
  "sadhana": [
    "Reflect on guṇa–karma: identify your natural tendencies (knowledge, leadership, commerce, service).",
    "Honor āśrama dharma: align duties with your life stage (student, householder, elder, renunciate).",
    "Engage community: treat jāti as support network, not rigid hierarchy.",
    "Reject rigidity: practice adhikāra-based eligibility — respect capacity, not birth-labels."
  ],
  "tags": [
    "caste",
    "varna",
    "ashrama",
    "jati",
    "colonial",
    "dharma",
    "social order"
  ]
},
{
  "name": "Justice and Punishment – Context vs Universality",
  "secular_one_liner": "Modern justice applies universal laws: punishment is proportional to the crime itself, irrespective of role, context, or stage of life.",
  "dharmic_one_liner": "Dharmic justice weighs not only the act but also varṇa (role), āśrama (life stage), adhikāra (eligibility), guṇa-state, and intent. Punishment (daṇḍa) is meant to restore dharma and contextually correct, not mechanically equalize.",
  "sanskrit_glossary": [
    "Nyāya (न्याय) – justice, order",
    "Daṇḍa (दण्ड) – punishment, discipline",
    "Adhikāra (अधिकार) – eligibility, competence",
    "Varṇa (वर्ण) – functional type by guṇa–karma",
    "Āśrama (आश्रम) – life stage duty",
    "Saṅkalpa (सङ्कल्प) – intention or resolve"
  ],
  "refs": [
    "Manu Smṛti | 8 | 337–340 | Penalties vary according to varṇa and context.",
    "Arthaśāstra | Book 1 | Daṇḍa as the protector of dharma, applied with discrimination.",
    "Mahābhārata | Śānti Parva | Justice is that which restores balance and harmony, not blind equality."
  ],
  "sadhana": [
    "Study adhikāra: reflect that duties differ by role and stage; fairness is not sameness.",
    "Contemplate saṅkalpa: weigh intent, not just act, when judging others.",
    "Practice restorative justice: aim to re-establish dharma, not to seek vengeance.",
    "Apply compassion in daṇḍa: correction should uplift, not merely punish."
  ],
  "tags": [
    "justice",
    "punishment",
    "danda",
    "adhikara",
    "varna",
    "ashrama",
    "dharma",
    "context"
  ]
},
{
  "name": "Why Me? vs Segmentation of Event and Experience",
  "secular_one_liner": "Suffering is often framed as 'Why me?', merging external events with inner experience into a personal burden.",
  "dharmic_one_liner": "The Gītā (13.21) teaches to distinguish what happened (kārya–kāraṇa, the field of prakṛti) from what is experienced (sukha–duḥkha, the bhoga of puruṣa). Segmenting event and experience transforms 'Why me?' into viveka: seeing circumstances as prakṛti’s play and consciousness as the witness.",
  "sanskrit_glossary": [
    "Prakṛti (प्रकृति) – nature, cause-effect machinery",
    "Puruṣa (पुरुष) – conscious Self, experiencer",
    "Kārya (कार्य) – effect, event that occurs",
    "Kāraṇa (कारण) – cause, conditions behind an event",
    "Bhoga (भोग) – experience of pleasure/pain",
    "Viveka (विवेक) – discernment between Self and not-Self"
  ],
  "refs": [
    "Bhagavad Gita | 13 | 21 | Prakṛti is cause of action, puruṣa is cause of experience.",
    "Sāṅkhya Kārikā | 17 | Differentiates prakṛti as active and puruṣa as passive witness.",
    "Bhagavad Gita | 2 | 14 | Endure sukha–duḥkha as passing sensations."
  ],
  "sadhana": [
    "When an event arises, say: 'This is prakṛti in motion.'",
    "When pain or joy is felt, say: 'This is bhoga, not my essence.'",
    "Practice viveka-dhyāna: separate external happening from inner witnessing.",
    "Transform 'Why me?' into 'What is prakṛti showing, and what is puruṣa witnessing?'"
  ],
  "tags": [
    "why me",
    "prakriti",
    "purusha",
    "bhoga",
    "viveka",
    "suffering",
    "discernment"
  ]
}
]